Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_LL_CORE/Src/USB_LL_Host.c
	if((USB_LL_Host___Host_Port[port_Number].channel_Buffer[channel_Number].buffer_Fill_Level + transfer_Size) <= USB_LL_Host___Host_Port[port_Number].channel_Buffer[channel_Number].transfer_Size)
	{
		USB_LL___FIFO_Transfer_Out(fifo, p_Buffer, transfer_Size);
		USB_LL_Host___Host_Port[port_Number].channel_Buffer[channel_Number].buffer_Fill_Level += transfer_Size;
	}
	else
	{
		return(USB_LL_Host___EXIT_FAILURE_BUFFER_OVERFLOW);
	}

	return(USB_LL_Host___EXIT_SUCCESS);
}

uint32_t* USB_LL_Host___Channel_Get_Fifo_Pointer(uint8_t port_Number, uint8_t channel_Number)
{
	uint32_t USB_offset = USB_LL___Get_USB_BASE(port_Number);
	return((uint32_t*)(USB_offset + USB_OTG_FIFO_BASE + (USB_OTG_FIFO_SIZE * channel_Number)));
}

void USB_LL_Host___Channel_Halt(uint8_t port_Number, uint8_t channel_Number)
{
	USB_OTG_HostChannelTypeDef* USB_Host_Channel = USB_LL___Get_USB_Host_Channel(port_Number, channel_Number);
	USB_OTG_HostTypeDef* USB_Host = USB_LL___Get_USB_Host(port_Number);

	if (!(USB_Host->HPTXSTS & USB_OTG_HPTXSTS_PTXQSAV_Msk))
	{
		USB_Host_Channel->HCCHAR |= USB_OTG_HCCHAR_CHDIS;
		USB_Host_Channel->HCCHAR |= USB_OTG_HCCHAR_CHENA;
	}

	USB_Host_Channel -> HCCHAR |= (USB_OTG_HCCHAR_CHDIS | USB_OTG_HCCHAR_CHENA);
}

uint8_t USB_LL_Host___Channel_Get_Current_Packet_ID(uint8_t port_Number, uint8_t channel_Number)
{
	USB_OTG_HostChannelTypeDef* USB_Host_Channel = USB_LL___Get_USB_Host_Channel(port_Number, channel_Number);
	return(USB_LL___GET_BIT_SEGMENT(USB_Host_Channel -> HCTSIZ, USB_OTG_HCTSIZ_DPID_Msk, USB_OTG_HCTSIZ_DPID_Pos));
}

void USB_LL_Host___Channel_Set_Interrupts(uint8_t port_Number,uint8_t channel_Number)
{
	USB_OTG_HostChannelTypeDef* USB_Host_Channel 	= USB_LL___Get_USB_Host_Channel(port_Number, channel_Number);
	USB_OTG_HostTypeDef*		USB_Host 			= USB_LL___Get_USB_Host(port_Number);
	USB_Host 			-> HAINTMSK |= (1 << channel_Number);
	USB_Host_Channel 	-> HCINTMSK  = USB_LL_Host___CHANNEL_INTERRUPTS_MASK;
}

void USB_LL_Host___Channel_Set_Characteristics
			(
			uint8_t port_Number,
			uint8_t channel_Number,
			uint16_t max_Packet_Size,
			uint8_t endpoint_Number,
			uint8_t endpoint_Direction,
			uint8_t low_Speed_Device,
			uint8_t endpoint_Type,
			uint8_t multi_Count,
			uint8_t device_Address,
			uint8_t odd_Frame
			)
{

	USB_LL_Host___Host_Port[port_Number].channel_Buffer[channel_Number].packet_Size 		= max_Packet_Size;
	USB_LL_Host___Host_Port[port_Number].channel_Buffer[channel_Number].transfer_Direction 	= endpoint_Direction;

	USB_OTG_HostChannelTypeDef* USB_Host_Channel = USB_LL___Get_USB_Host_Channel(port_Number, channel_Number);

	USB_LL_Host___Host_Port[port_Number].channel_Buffer[channel_Number].retry_After_Halt = 0;

	uint32_t channel_Characteristics =
			(
			max_Packet_Size 	<< USB_OTG_HCCHAR_MPSIZ_Pos |
			endpoint_Number 	<< USB_OTG_HCCHAR_EPNUM_Pos |
			endpoint_Direction 	<< USB_OTG_HCCHAR_EPDIR_Pos |
			low_Speed_Device 	<< USB_OTG_HCCHAR_LSDEV_Pos |
			endpoint_Type 		<< USB_OTG_HCCHAR_EPTYP_Pos |
			multi_Count 		<< USB_OTG_HCCHAR_MC_Pos 	|
			device_Address 		<< USB_OTG_HCCHAR_DAD_Pos
			);

	USB_Host_Channel -> HCCHAR = channel_Characteristics;
}

void USB_LL_Host___Channel_Setup_Buffer(uint8_t port_Number, uint8_t channel_Number, uint8_t *buffer_Pointer, uint32_t transfer_Size)
{
	USB_LL_Host___Channel_Set_Buffer_Pointer(port_Number, channel_Number, buffer_Pointer);
	USB_LL_Host___Channel_Set_Transfer_Size(port_Number, channel_Number, transfer_Size);
	USB_LL_Host___Channel_Reset_Transfer_Progress(port_Number, channel_Number);
	USB_LL_Host___Channel_Reset_Buffer_Fill_Level(port_Number, channel_Number);
}

void USB_LL_Host___Channel_Load_HCTSIZ(uint8_t port_Number, uint8_t channel_Number, uint32_t transfer_Size_In_Bytes, uint32_t packet_Count, uint8_t packet_ID)
{
	USB_OTG_HostChannelTypeDef* USB_Host_Channel = USB_LL___Get_USB_Host_Channel(port_Number, channel_Number);
	USB_Host_Channel -> HCTSIZ = (transfer_Size_In_Bytes << USB_OTG_HCTSIZ_XFRSIZ_Pos | packet_Count << USB_OTG_HCTSIZ_PKTCNT_Pos | packet_ID << USB_OTG_HCTSIZ_DPID_Pos);
}

void USB_LL_Host___Transfer_Next_Packet(uint8_t port_Number, uint8_t channel_Number)
{
	uint32_t* FIFO_Pointer 				= USB_LL_Host___Channel_Get_Fifo_Pointer(port_Number, channel_Number);
	uint32_t  transfer_Size_Remaining 	= USB_LL_Host___Channel_Get_Transfer_Size(port_Number, channel_Number) - USB_LL_Host___Channel_Get_Transfer_Progress(port_Number, channel_Number);
	uint16_t  transfer_Size 			= USB_LL_Host___GET_MIN(transfer_Size_Remaining, USB_LL_Host___Channel_Get_Packet_Size(port_Number, channel_Number));
	uint8_t*  buffer_Pointer			= USB_LL_Host___Channel_Get_Buffer_Pointer(port_Number, channel_Number);

	USB_LL___FIFO_Transfer_In(buffer_Pointer, FIFO_Pointer, transfer_Size);
}

#include <stdio.h>

void USB_LL_Host___Channel_Begin_Transfer_In(uint8_t port_Number, uint8_t channel_Number)
{
	USB_OTG_HostChannelTypeDef *USB_Host_Channel = USB_LL___Get_USB_Host_Channel(port_Number, channel_Number);

	USB_Host_Channel -> HCCHAR &= ~(USB_OTG_HCCHAR_ODDFRM_Msk);
	USB_Host_Channel -> HCCHAR |= ((USB_LL_Host___Host_Get_Frame_Number(port_Number) % 2)) << USB_OTG_HCCHAR_ODDFRM_Pos;

	USB_Host_Channel->HCCHAR |= USB_OTG_HCCHAR_CHENA;
}

void USB_LL_Host___Channel_Begin_Transfer_Out(uint8_t port_Number, uint8_t channel_Number)
{
	USB_OTG_HostChannelTypeDef *USB_Host_Channel = USB_LL___Get_USB_Host_Channel(port_Number, channel_Number);

	USB_Host_Channel -> HCCHAR &= ~(USB_OTG_HCCHAR_ODDFRM_Msk);
	USB_Host_Channel -> HCCHAR |= ((USB_LL_Host___Host_Get_Frame_Number(port_Number) % 2)) << USB_OTG_HCCHAR_ODDFRM_Pos;

	USB_Host_Channel->HCCHAR |= USB_OTG_HCCHAR_CHENA;

	USB_LL_Host___Transfer_Next_Packet(port_Number, channel_Number);
}

void USB_LL_Host___Channel_Out_Packet_Acknowledged(uint8_t port_Number, uint8_t channel_Number)
{
	uint16_t  packet_Size 				= USB_LL_Host___Channel_Get_Packet_Size(port_Number, channel_Number);
	uint16_t  size_Transfered 			= USB_LL_Host___GET_MIN(packet_Size, (USB_LL_Host___Channel_Get_Transfer_Size(port_Number, channel_Number) - USB_LL_Host___Channel_Get_Transfer_Progress(port_Number, channel_Number)));

	USB_LL_Host___Host_Port[port_Number].channel_Buffer[channel_Number].transfer_Progress += size_Transfered;

	uint16_t  transfer_Size_Remaining 	= USB_LL_Host___Channel_Get_Transfer_Size(port_Number, channel_Number) - USB_LL_Host___Channel_Get_Transfer_Progress(port_Number, channel_Number);

	if(transfer_Size_Remaining > 0)
	{
		USB_LL_Host___Transfer_Next_Packet(port_Number, channel_Number);
	}
}

void USB_LL_Host___Channel_In_Packet_Acknowledged(uint8_t port_Number, uint8_t channel_Number)
{
	uint16_t  packet_Size 				= USB_LL_Host___Channel_Get_Packet_Size(port_Number, channel_Number);
	uint16_t  size_Transfered 			= USB_LL_Host___GET_MIN(packet_Size, (USB_LL_Host___Channel_Get_Transfer_Size(port_Number, channel_Number) - USB_LL_Host___Channel_Get_Transfer_Progress(port_Number, channel_Number)));

	USB_LL_Host___Host_Port[port_Number].channel_Buffer[channel_Number].transfer_Progress += size_Transfered;

	uint16_t  transfer_Size_Remaining 	= USB_LL_Host___Channel_Get_Transfer_Size(port_Number, channel_Number) - USB_LL_Host___Channel_Get_Transfer_Progress(port_Number, channel_Number);

	if(transfer_Size_Remaining > 0)
	{
		USB_LL_Host___Channel_Begin_Transfer_In(port_Number, channel_Number);
	}
}

