Jack-Herron/STM32_Skipper_Development/USB Device And Host Development/USB_LL_CORE/Src/USB_LL_Host.c
			if(USB_LL_Host___Channel_Get_Retry_After_Halt(port_Number, channel_Number))
			{
				if (USB_LL_Host___Channel_Get_Transfer_Direction(port_Number, channel_Number) == USB_LL_Host___TRANSFER_DIRECTION_OUT)
				{
					USB_LL_Host___Channel_Retry_Transfer_Out(port_Number, channel_Number);
				}
				else
				{
					USB_LL_Host___Channel_Retry_Transfer_In(port_Number, channel_Number);
				}

				USB_LL_Host___Channel_Set_Retry_After_Halt(port_Number, channel_Number, false);
			}
			else
			{

			}
			break;

		case USB_OTG_HCINT_STALL_Pos: 								// channel Stall received
			USB_Host_Ch -> HCINT = USB_OTG_HCINT_STALL_Msk;

			USB_LL_Host___Set_Channel_Status_Change_Flag(port_Number, channel_Number);
			host_Status[port_Number].channel_Status[channel_Number].device_Address = device_Address;
			host_Status[port_Number].channel_Status[channel_Number].status = USB_LL_Host___CHANNEL_STATUS_TRANSFER_FAILED_STALL;
			break;

		case USB_OTG_HCINT_NAK_Pos: 								// NAK received
		{
			USB_Host_Ch -> HCINT = USB_OTG_HCINT_NAK_Msk;

			uint16_t retries_Remaining = USB_LL_Host___Channel_Get_Retries_Remaining(port_Number, channel_Number);
			if (retries_Remaining > 0)
			{
				if(USB_LL_Host___Channel_Get_Transfer_Direction(port_Number, channel_Number) == USB_LL_Host___TRANSFER_DIRECTION_OUT)
				{
					USB_LL_Host___Channel_Halt(port_Number, channel_Number);
					USB_LL_Host___Channel_Set_Retry_After_Halt(port_Number, channel_Number, true);
				}
				else
				{
					USB_LL_Host___Channel_Retry_Transfer_In(port_Number, channel_Number);
				}
				USB_LL_Host___Channel_Set_Retries_Remaining(port_Number, channel_Number, retries_Remaining-1);
			}
			else
			{
				USB_LL_Host___Channel_Halt(port_Number, channel_Number);
				USB_LL_Host___Set_Channel_Status_Change_Flag(port_Number, channel_Number);
				host_Status[port_Number].channel_Status[channel_Number].device_Address = device_Address;
				host_Status[port_Number].channel_Status[channel_Number].status = USB_LL_Host___CHANNEL_STATUS_TRANSFER_FAILED_NAK;
			}
			break;
		}

		case USB_OTG_HCINT_ACK_Pos: 										// ACK received
			USB_Host_Ch->HCINT = USB_OTG_HCINT_ACK_Msk;
			//USB_LL_Host___Debug_Log("ACK\n");
			if(USB_LL_Host___Channel_Get_Transfer_Direction(port_Number, channel_Number) == USB_LL_Host___TRANSFER_DIRECTION_OUT)
			{
				USB_LL_Host___Channel_Out_Packet_Acknowledged(port_Number, channel_Number);
			}
			else
			{
				USB_LL_Host___Channel_In_Packet_Acknowledged(port_Number, channel_Number);
			}
			break;

		case USB_OTG_HCINT_TXERR_Pos: 								// TX ERROR received
			USB_Host_Ch -> HCINT = USB_OTG_HCINT_TXERR_Msk;

			uint16_t retries_Remaining = USB_LL_Host___Channel_Get_Retries_Remaining(port_Number, channel_Number);
			if (retries_Remaining > 0)
			{
				if(USB_LL_Host___Channel_Get_Transfer_Direction(port_Number, channel_Number) == USB_LL_Host___TRANSFER_DIRECTION_OUT)
				{
					USB_LL_Host___Channel_Halt(port_Number, channel_Number);
					USB_LL_Host___Channel_Set_Retry_After_Halt(port_Number, channel_Number, true);
				}
				else
				{
					USB_LL_Host___Channel_Halt(port_Number, channel_Number);
					USB_LL_Host___Channel_Set_Retry_After_Halt(port_Number, channel_Number, true);
				}
				USB_LL_Host___Channel_Set_Retries_Remaining(port_Number, channel_Number, retries_Remaining-1);
			}
			else
			{
				USB_LL_Host___Channel_Halt(port_Number, channel_Number);
				USB_LL_Host___Set_Channel_Status_Change_Flag(port_Number, channel_Number);
				host_Status[port_Number].channel_Status[channel_Number].device_Address = device_Address;
				host_Status[port_Number].channel_Status[channel_Number].status = USB_LL_Host___CHANNEL_STATUS_TRANSFER_FAILED_ERROR;
			}
			break;

		case USB_OTG_HCINT_FRMOR_Pos: 								// Frame Error received
			USB_Host_Ch -> HCINT = USB_OTG_HCINT_FRMOR_Msk;

			USB_LL_Host___Channel_Halt(port_Number, channel_Number);
			USB_LL_Host___Set_Channel_Status_Change_Flag(port_Number, channel_Number);
			host_Status[port_Number].channel_Status[channel_Number].device_Address = device_Address;
			host_Status[port_Number].channel_Status[channel_Number].status = USB_LL_Host___CHANNEL_STATUS_TRANSFER_FAILED_ERROR;
			break;

		case USB_OTG_HCINT_DTERR_Pos: 								// Frame Error received
			USB_Host_Ch -> HCINT = USB_OTG_HCINT_DTERR_Msk;

			USB_LL_Host___Channel_Halt(port_Number, channel_Number);
			USB_LL_Host___Set_Channel_Status_Change_Flag(port_Number, channel_Number);
			host_Status[port_Number].channel_Status[channel_Number].device_Address = device_Address;
			host_Status[port_Number].channel_Status[channel_Number].status = USB_LL_Host___CHANNEL_STATUS_TRANSFER_FAILED_ERROR;

			break;
		}
	}
}
